УРВ_файловая/src/InformationRegisters/ПодпискиНаУведомления/ПодпискиНаУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодпискиНаУведомления</name>
  <resources>
    <name>ПодпискаАктивна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.ВидыБизнесСобытий</types>
      <types>EnumRef.СобытияУведомлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПодписки</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>CatalogRef.Пользователи</types>
      <types>DocumentRef.Обращение</types>
      <types>CatalogRef.Ошибки</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/Enums/НастройкиУведомлений/НастройкиУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НастройкиУведомлений</name>
  <enumValues>
    <name>СрокУведомления</name>
  </enumValues>
  <enumValues>
    <name>ЧастотаУведомления</name>
  </enumValues>
  <enumValues>
    <name>Подписка</name>
  </enumValues>
</mdclass:Enum>

УРВ_файловая/src/InformationRegisters/ПодпискиНаУведомления/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидСобытия") Тогда
		ОтображатьВидСобытия = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"ВидСобытия",
			Параметры.ВидСобытия);
		ВидСобытия = Параметры.ВидСобытия;
		ПодпискаНаВидСобытияПоУмолчанию =
			РаботаСУведомлениями.ПолучитьНастройкуПоУмолчанию(Перечисления.НастройкиУведомлений.Подписка, ВидСобытия);
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.ОтборВидСобытия.Видимость = ОтображатьВидСобытия;
	Элементы.СписокВидСобытия.Видимость = Не ОтображатьВидСобытия;
	Элементы.ПодпискаПоУмолчанию.Видимость = ОтображатьВидСобытия;
	
КонецПроцедуры

#КонецОбласти
